src/DataProcessors/ЗагрузкаЦенПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЦенПоставщиков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПродажиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ЗагрузкаЦенПоставщиков/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.СогласовыватьЦены.Видимость = ПользовательСПолнымиПравами();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	ЗагрузитьФайл();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьФайл()
	
	Если Не ЗначениеЗаполнено(Контрагент) ИЛИ Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		СообщитьПользователю("Проверьте заполненность реквизитов. Без заполнения реквизитов загрузка невозможна.");
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(, , , ПутьКФайлу, УникальныйИдентификатор);
	РезультатЗагрузки = ЗагрузитьФайлНаСервере(ОписаниеФайла.Адрес, УникальныйИдентификатор);
	
	СоздаватьНоменклатуру = Ложь;
	
	Если Не РезультатЗагрузки.ВсяНоменклатураНайдена Тогда
		
		ТекстВопроса = "Не все номенклатурные позиции из файла существуют в справочнике. Выберите вариант действий:";
		
		ВариантыОтвета = НовыйВариантыОтвета();
		
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, ВариантыОтвета);
		
		Если ОтветПользователя = "Нет" Тогда
			Возврат;
		ИначеЕсли ОтветПользователя = "Да" Тогда
			СоздаватьНоменклатуру = Истина;
		КонецЕсли;

	КонецЕсли;

	СоздатьДокумент(Контрагент,РезультатЗагрузки.АдресДанныхФайла,СогласовыватьЦены,СоздаватьНоменклатуру);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьФайлНаСервере(АдресФайлаВоВременномХранилище, УникальныйИдентификатор)

	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("csv");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);

	РезультатЗагрузки = Новый Структура("ВсяНоменклатураНайдена, АдресДанныхФайла", Истина, Неопределено);
	ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор);

	// Очистим ненужные объекты
	УдалитьФайлы(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);

	Возврат РезультатЗагрузки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор)

	ТекстовыйФайлЗагрузки = Новый ТекстовыйДокумент;
	ТекстовыйФайлЗагрузки.Прочитать(ИмяВременногоФайла, КодировкаТекста.Системная);

	ДанныеФайла = Новый Массив;
	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");

	Для НомерСтроки = 1 по ТекстовыйФайлЗагрузки.КоличествоСтрок() Цикл

		НоваяСтрока = ТекстовыйФайлЗагрузки.ПолучитьСтроку(НомерСтроки);

		Позиция = Найти(НоваяСтрока, ";");

		НаименованиеНоменклатуры = Сред(НоваяСтрока, 1, Позиция - 1);
		Цена = Сред(НоваяСтрока, Позиция + 1);

		ДанныеСтрокиДокумента = Новый Структура;
		ДанныеСтрокиДокумента.Вставить("НаименованиеНоменклатуры", НаименованиеНоменклатуры);
		ДанныеСтрокиДокумента.Вставить("Цена", Цена);

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатуры); 
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, НаименованиеНоменклатуры);
			Сообщение.Сообщить();

			РезультатЗагрузки.ВсяНоменклатураНайдена = Ложь;
		КонецЕсли;
		
		ДанныеСтрокиДокумента.Вставить("НоменклатураСсылка", Номенклатура);
		
		ДанныеФайла.Добавить(ДанныеСтрокиДокумента);

	КонецЦикла;

	РезультатЗагрузки.АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Функция ПользовательСПолнымиПравами()
	
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава);

КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДокумент(Контрагент, АдресДанныхФайла, СогласовыватьЦены, СоздаватьНоменклатуру)

	// Создаём новый документ
	ДокументЦены = Документы.УстановкаЦен.СоздатьДокумент();
	ДокументЦены.Дата = ТекущаяДата();
	ДокументЦены.Контрагент = Контрагент;
	ДокументЦены.Комментарий = "Загружен из файла";

	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанныхФайла);

	Для Каждого ДанныеСтроки Из ДанныеФайла Цикл

		Номенклатура = ДанныеСтроки.НоменклатураСсылка;

		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Если Не СоздаватьНоменклатуру Тогда
				Продолжить;
			Иначе
				Номенклатура = СоздатьНоменклатуру(ДанныеСтроки);
				Если Номенклатура = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
		НоваяСтрокаТЧ.Номенклатура = Номенклатура;
		НоваяСтрокаТЧ.Цена = ДанныеСтроки.Цена;

	КонецЦикла;

	Если СогласовыватьЦены Тогда
		ДокументЦены.Согласовано = Истина;
		ДокументЦены.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокументЦены.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;

	УдалитьИзВременногоХранилища(АдресДанныхФайла);
	
КонецПроцедуры

&НаКлиенте
Функция НовыйВариантыОтвета()
	
	ВариантыОтвета = Новый СписокЗначений;
	ВариантыОтвета.Вставить(0, "Нет", "Не создавать документ");
	ВариантыОтвета.Вставить(1, "НетЦены", "Не загружать цены");
	ВариантыОтвета.Вставить(2, "Да", "Создавать номенклатуру");
	
	Возврат ВариантыОтвета;
	
КонецФункции

&НаСервере
Функция НайтиНоменклатуру(ДанныеФайла)
	
	ВсяНоменклатураНайдена = Истина;
	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");

	Для Каждого ДанныеСтроки Из ДанныеФайла Цикл

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ДанныеСтроки.НаименованиеНоменклатуры);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, ДанныеСтроки.НаименованиеНоменклатуры);
			Сообщение.Сообщить();

			ВсяНоменклатураНайдена = Ложь;
		КонецЕсли;

		ДанныеСтроки.Вставить("НоменклатураСсылка", Номенклатура);

	КонецЦикла;

	Возврат ВсяНоменклатураНайдена;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьНоменклатуру(ДанныеСтроки)
	
	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	Номенклатура.Наименование = ДанныеСтроки.НаименованиеНоменклатуры;
	Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	
	Попытка
		Номенклатура.Записать();
		Сообщить(СтрШаблон(НСтр("ru = 'Номенклатура %1 создана'"),ДанныеСтроки.НаименованиеНоменклатуры));
		
		Возврат Номенклатура.Ссылка;
		
	Исключение
		Сообщить(СтрШаблон(НСтр("ru = 'Номенклатура %1 не создана по причине: %2'"),ДанныеСтроки.НаименованиеНоменклатуры,ОписаниеОшибки()));
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПутьКФайлу = "";
	ОбработатьВыборФайла();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьВыборФайла()
	
	ДиалогВыбораФайла = НовыйДиалогВыбораФайла();
	
	РезультатВыбора = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		СообщитьПользователю("Файл не выбран!");
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = РезультатВыбора[0];
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователю(Текст)
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Текст;
	СообщениеПользователю.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция НовыйДиалогВыбораФайла()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл для загрузки цен поставщиков";
	ДиалогВыбораФайла.Фильтр = "Текстовый файл|*.csv";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	
	Возврат ДиалогВыбораФайла;
	
КонецФункции
